[
  {
    "card": {
      "title": "Fingerprint Inpainting",
      "startDate": "Feb 2025",
      "endDate": "Apr 2025",
      "image": "fp.png",
      "placeholder": "F.PRINT",
      "bullets": [
        "Trained on NIST fingerprint dataset to develop a model to inpaint damaged fingerprints",
        "Implemented data augmentation techniques to improve model robustness"
      ]
    },
    "modal": {
      "segments": [
        {
          "text": "This research project explores the advanced application of deep learning for fingerprint inpainting. The focus was on accurately restoring missing or damaged ridge patterns in partial fingerprint images, a capability with significant implications for enhancing forensic analysis and identification processes. The deep learning model was rigorously trained on a large and diverse dataset of masked fingerprints, which was generated using the NIST dataset by using a custom masking pipeline with computer vision technologies. This approach ensured that the model learned to reconstruct realistic ridge patterns from incomplete data, addressing a critical challenge in biometric recognition.",
          "image": "fp2.png"
        },
        {
          "text": "First, we implemented a custom masking pipeline that detects the various patterns in a fingerprint. These labels were done by hand using Roboflow. A YOLO model was then trained to identify and mask these patterns, generating a large dataset of masked fingerprints. The model was then trained on this dataset to learn how to inpaint the missing parts of the fingerprint. Data augmentation techniques were employed to enhance the model's robustness, including rotation, scaling, and noise addition, which significantly improved its ability to generalize across different fingerprint types and qualities.",
          "image": "fp3.png"
        },
        {
          "text": "We then researched on the various architectures that could be used to inpaint the fingerprints. We found that the best architecture was the U-Net model, which is a type of convolutional neural network (CNN) that is particularly effective for inpainting tasks. The U-Net model was trained on the masked fingerprints, and it was able to learn how to inpaint the missing parts of the fingerprint. We then added various enhancements to the model, such as attention mechanisms and residual connections, to further improve its performance.",
          "image": "fp4.png"
        },
        {
          "text": null,
          "image": "fp5.png"
        },
        {
          "text": "The final model demonstrated impressive performance in reconstructing missing fingerprint features, achieving high accuracy and fidelity in the restored images. This project not only contributes to the field of biometric recognition but also serves as a foundation for future research into more complex inpainting tasks across various domains.",
          "image": "fp6.png"
        },
        {
          "linkGroup": {
            "demo": "",
            "source": null
          }
        }
      ]
    }
  },
  {
    "card": {
      "title": "EmpathIQ",
      "startDate": "Sep 2024",
      "endDate": "Apr 2025",
      "image": "empathiq.png",
      "placeholder": "EMPATHIQ",
      "bullets": [
        "AI communications coaching simulator for TTSH, for medical students",
        "Used various microservices using Java, Spring Boot, and Apache Kafka to to build the app"
      ]
    },
    "modal": {
      "segments": [
        {
          "text": "EmpathIQ is an AI communications coaching simulator that provides medical students with quality communications training with an AI Avatar that roleplays as a patient. After the conversation, a feedback system analyzes the conversation and provides feedback on how to improve their communication skills. This project was developed in collaboration with Tan Tock Seng Hospital (TTSH) in Singapore, aiming to enhance the communication skills of medical students by providing them with equally realistic and interactive training scenarios as their current, real-life roleplay training.",
          "image": "empathiq-demo.png"
        },
        {
          "text": "The backend was developed using Java, Spring Boot, and Apache Kafka, ensuring high-throughput real-time data processing and efficient feedback delivery. A intuitive avatar interface was created to simulate realistic conversational scenarios, providing an engaging and safe environment for practicing communication. Advanced Natural Language Processing (NLP) techniques were integrated into the system to analyze spoken communication patterns, offering constructive and nuanced feedback on aspects such as empathy, clarity, tone, and active listening.",
          "image": "empathiq-architecture.png"
        },
        {
          "text": "The AI services used to make the app were OpenAI's GPT-4o and Hume AI's EVI 2. We also tried to use ElevenLabs for the speech synthesis which would have enabled a Singaporean accent to be used, however due to time constraints we left it as a work in progress.",
          "image": null
        },
        {
          "text": "We also worked with a freelance 3D modeler to create a realistic avatar that would be used in the app. The avatar was designed to be as realistic as possible, with realistic facial expressions and body language. However, due to time constraints, we were unable to implement the more realistic avatar in the app. Instead, we stuck with our current ReadyPlayerMe avatar.",
          "image": "empathiq-model.png"
        },
        {
          "text": "(Other parts of the app such as the UI design, the backend services, review agent and scenario creation features were also developed by the team; however, this is intended to be a high-level overview of the project.)",
          "image": null
        },
        
        {
          "linkGroup": {
            "demo": "",
            "source": "https://empathiq-sg.com/"
          }
        }
      ]
    }
  },
  {
    "card": {
      "title": "RAG LLM App",
      "startDate": "Aug 2024",
      "endDate": "",
      "image": "ollama.png",
      "placeholder": "RAG",
      "bullets": [
        "Implemented vector store and retrieval pipeline in Python",
        "Integrated front-end with custom PDF uploader and query interface"
      ]
    },
    "modal": {
      "segments": [
        {
          "text": "I was inspired by LTA's efforts at creating a company-wide RAG app. As such, in my own exploration, my goal was to create a UI that allowed users to upload PDFs and query them with natural language. The app would then return the most relevant information from the PDF, making it easy for users to find answers to their questions. I used Ollama's local embedding model to generate embeddings and store them in a ChromaDB vector database, and then used Mistral via Ollama to generate responses.",
          "image": "ollama2.png"
        },
        {
          "linkGroup": {
            "demo": "",
            "source": "https://github.com/ibra2407/rag-llm-ui"
          }
        }
      ]
    }
  },
  {
    "card": {
      "title": "Digital App Gallery",
      "startDate": "May 2024",
      "endDate": "Aug 2024",
      "image": "dag.png",
      "placeholder": "LTA",
      "bullets": [
        "Built a React portal to showcase internal apps and tools",
        "Implemented CI/CD pipelines using AWS CodePipeline"
      ]
    },
    "modal": {
      "segments": [
        {
          "text": "This project involved the development of a comprehensive React-based portal for the Land Transport Authority (LTA) in Singapore. Its primary purpose was to centralize and provide easy access to a multitude of internal applications and tools, thereby significantly enhancing digital accessibility for all employees. The platform is intended to serve over 6,000 users, and marked a key contribution to the LTA's ongoing internal digitalization efforts.",
          "image": "dag2.png"
        },
        {
          "text": "The front-end user interface was developed using React.js, with a strong emphasis on creating a clean, intuitive, and highly responsive design to ensure an optimal user experience. Robust Continuous Integration/Continuous Deployment (CI/CD) pipelines were implemented leveraging AWS CodePipeline and CodeDeploy, which automated and streamlined the deployment processes, ensuring rapid and reliable updates. User-friendly interfaces were designed with integrated analytics capabilities to track app usage, providing valuable insights into employee engagement and facilitating continuous platform improvement and discoverability of essential work tools. Testing with Cypress, JMeter and Postman was also implemented to ensure the robustness and security of the platform.",
          "image": null
        },
        {
          "linkGroup": {
            "demo": "",
            "source": ""
          }
        }
      ]
    }
  },
  {
    "card": {
      "title": "Bacteria Simulation",
      "startDate": "Jan 2024",
      "endDate": "",
      "image": "bacteria.png",
      "placeholder": "BACT",
      "bullets": [
        "Modeled bacteria behavior using rule-based agents in Python",
        "Visualized population dynamics over varying simulation parameters"
      ]
    },
    "modal": {
      "segments": [
        {
          "text": "This simulation models the complex behavior of fictional bacteria populations in a dynamic environment. Utilizing rule-based agents, the system mimics biological processes like growth, interaction, and environmental responses, providing a compelling visual output. Bacterias can move, reproduce, and interact with other bacteria, simulating the intricate interactions that occur within a biological system. A suite of graphs visualize the population dynamics over varying simulation parameters, including initial population, growth rate, and environmental conditions. The project's innovative approach to biological modeling garnered recognition, leading to its selection for presentation at the prestigious 2024 SUTD ESD Industry Showcase.",
          "image": "bacteria.png"
        },
        {
          "text": "Personally, this was an extremely fun project to work on. I had a lot of fun designing the bacteria and their behaviors, and I learned a lot about how to use Python to create simulations. The project was also a great opportunity to learn about how to use rule-based agents to model complex systems. The simulation is highly customizable, allowing users to adjust parameters such as initial population size, growth rate, and environmental conditions, providing a rich platform for exploring biological dynamics.",
          "image": null
        },
                {
          "text": "More details, including screenshots and a demo, can be found in the link below.",
          "image": null
        },
        {
          "linkGroup": {
            "demo": "",
            "source": "https://github.com/ibra2407/bacteria"
          }
        }
      ]
    }
  },
  {
    "card": {
      "title": "Maze Solver",
      "startDate": "Jan 2024",
      "endDate": "",
      "image": "maze.png",
      "placeholder": "MAZE",
      "bullets": [
        "Evolved populations of candidate solutions to navigate grid mazes",
        "Animated the progressive improvement of solution fitness"
      ]
    },
    "modal": {
      "segments": [
        {
          "text": "This project presents an evolutionary algorithm-based maze solver designed to efficiently navigate complex grid mazes. It generates and evolves populations of candidate solutions, dynamically refining paths across successive generations. The application provides a clear, real-time visualization of how solution fitness progressively improves, making the abstract concepts of evolutionary computing tangible.",
          "image": "maze.png"
        },
        {
          "text": "More details, including a demo, can be found in the link below.",
          "image": null
        },
        {
          "linkGroup": {
            "demo": "",
            "source": "https://github.com/ibra2407/mazesolver"
          }
        }
      ]
    }
  },
  {
    "card": {
      "title": "SKH React Game",
      "startDate": "Sep 2023",
      "endDate": "Dec 2023",
      "image": "skhgame.png",
      "placeholder": "SKH",
      "bullets": [
        "Designed & deployed a browser game to boost staff engagement in internal network",
        "Successfully increased participation in donation campaigns"
      ]
    },
    "modal": {
      "segments": [
        {
          "text": "For SKH, I developed a browser-based game in React to enhance staff engagement and participation in internal donation campaigns. The project was initiated to address the challenge of low participation rates in internal donation drives, which were crucial for supporting various charitable initiatives. The game was designed to be engaging and visually appealing, providing a fun way for employees to give back while also fostering a sense of community within the organization.",
          "image": "skhgame.png"
        },
        {
          "text": "Being my first React project, I had to learn web fundamentals and React concepts. I proposed the idea of a gatcha game, where the pulled character was randomized. Each pull requires a donation. The idea is that staff members would continue to play (and thus keep donating) until they got the one they wanted. The game is complemented by actual physical hero figurines that staff donors would receive. I faced many IT challenges pertaining to the deployment of the game on their intranet, so the tracking of staff participation was done manually, logging them into an internal Excel sheet that was then used to track the donations. Personally, I felt that the website left a lot to be desired; my implementation was far from optimal, but it was a good first step into the world of web development.",
          "image": null
        },
        {
          "linkGroup": {
            "demo": "https://skhgh2024.vercel.app/?id=123",
            "source": "https://github.com/ibra2407/claw"
          }
        }
      ]
    }
  },
  {
    "card": {
      "title": "Sushi Restaurant Game",
      "startDate": "2023",
      "endDate": "",
      "image": "sushi.png",
      "placeholder": "SUSHI",
      "bullets": [
        "Modeled real-world arrival rates and service times",
        "Implemented dynamic UI updates in RShiny"
      ]
    },
    "modal": {
      "segments": [
        {
          "text": "This project developed a simulation game for a sushi restaurant, meticulously designed to assist managers in optimizing their operations. The primary goal was to improve customer throughput and overall efficiency within the restaurant without requiring additional staff. The simulation accurately models real-world customer arrival rates and service times, offering a realistic scenario for strategic operational planning.",
          "image": null
        },
        {
          "text": "A robust discrete-event simulation model was developed to represent the intricate operations of the sushi restaurant, from customer seating to order fulfillment. Dynamic user interface updates were implemented using RShiny, allowing managers to interact with simulation parameters in real-time and immediately observe the impacts of their decisions. The tool provides actionable insights into optimal staffing levels, kitchen efficiency, and predicted customer wait times under various operational scenarios, receiving positive feedback for its intuitive controls and clear visual feedback.",
          "image": null
        },
        {
          "linkGroup": {
            "demo": "",
            "source": "https://github.com/ibra2407/sushi"
          }
        }
      ]
    }
  },
  {
    "card": {
      "title": "Project with Yeo's",
      "startDate": "Jan 2023",
      "endDate": "Apr 2023",
      "image": "yeos.png",
      "placeholder": "YEO'S",
      "bullets": [
        "Built clustering & scheduling algorithms to minimize delivery distance and idle time",
        "Developed a PowerBI + ArcGIS dashboard for real-time KPI tracking"
      ]
    },
    "modal": {
      "segments": [
        {
          "text": "This project addressed the challenge of optimizing logistics for Yeo's vending machine network in Singapore. The primary goal wasn't just greater efficiency, but improving the truck drivers' quality of life by reducing the number of trips they had to make. The project involved the development of clustering and scheduling algorithms that minimized delivery distances and wasted time (e.g., finding the exact entry point for a customer, waiting around for a customer's pickup time), significantly enhancing operational efficiency. The algorithms were designed to intelligently group vending machines based on their locations and product demand patterns, allowing for more efficient route planning and resource allocation.",
          "image": "yeos.png"
        },
        {
          "text": null,
          "image": "yeos1.png"
        },
        {
          "text": "In addition to the algorithms, a comprehensive dashboard was developed using PowerBI and ArcGIS. This dashboard provided real-time tracking of key performance indicators (KPIs), offering valuable insights into the operational efficiency of the vending machine network. It enabled stakeholders to monitor performance metrics, such as delivery times, product availability, and customer interactions, facilitating data-driven decision-making and continuous improvement.",
          "image": "yeos2.png"
        },
        {
          "text": "In line with the project agreement, we are not allowed to share the code or any sensitive business data. However, our presentation slides, including screenshots of the dashboard and other features were approved to be presented, and can be found in the link below.",
          "image": null
        },
        {
          "linkGroup": {
            "demo": "",
            "source": "https://www.canva.com/design/DAGD35MUmcM/m6sKM0o2a9w8T5jNuybeag/edit"
          }
        }
      ]
    }
  },
  {
    "card": {
      "title": "Data Analysis on Hunger",
      "startDate": "2022",
      "endDate": "",
      "image": "analytics.png",
      "placeholder": "DATA",
      "bullets": [
        "Analyzed various datasets about developing countries",
        "Built an interactive dashboard for visual insights"
      ]
    },
    "modal": {
      "segments": [
        {
          "text": "This comprehensive data analysis project delved into the multifaceted issue of global hunger, aiming to uncover critical correlations and insights into food insecurity worldwide. It involved rigorously cleaning and integrating diverse datasets from multiple sources to provide a holistic view of the problem. The analysis focused on the interplay between socio-economic factors, such as GDP per capita and education levels, and their impact on food security. The project was driven by the goal of identifying actionable insights that could inform policy decisions and humanitarian efforts.",
          "image": "analytics.png"
        },
        {
          "text": "More details, including a demo, can be found in the link below.",
          "image": null
        },
        {
          "linkGroup": {
            "demo": "https://jwiggs.github.io/GHPages/visualisation.html",
            "source": "https://github.com/JWIGGS/GHPages"
          }
        }
      ]
    }
  }
]